why-i-code-in-c.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-13 Sat 14:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>why i code in C</title>
<meta name="author" content="bill wear" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">why i code in C</h1>
<div id="outline-container-org1d2a158" class="outline-2">
<h2 id="org1d2a158">Why I code in C</h2>
<div class="outline-text-2" id="text-org1d2a158">
<p>
Let's take stock of what's written in C.  Or better yet, let's ask a
slightly different question.
</p>
</div>
<div id="outline-container-orge65369e" class="outline-3">
<h3 id="orge65369e">What's <b>not</b> written in C?</h3>
<div class="outline-text-3" id="text-orge65369e">
<p>
This list isn't exhaustive, but it gets the point across:
</p>

<ul class="org-ul">
<li>FORTRAN</li>
<li>COBOL</li>
<li>Lisp</li>
<li>ALGOL</li>
<li>Pure assembly language</li>
</ul>

<p>
Nearly everything else that dominates GitHub today is either a child,
grandchild, or cousin of C &#x2013; meaning that the language is either
compiled or interpreted by code written in C, or the language in which
it's written was compiled or interpreted by code written in C.  Here's
my list of these:
</p>

<ul class="org-ul">
<li>Python</li>
<li>JavaScript</li>
<li>PHP</li>
<li>Ruby</li>
<li>Lua</li>
<li>Perl</li>
<li>R</li>
<li>C++</li>
<li>Java</li>
<li>C#/.NET</li>
<li>Node.js</li>
<li>Go</li>
<li>Rust</li>
<li>Clojure</li>
<li>Scala</li>
<li>Kotlin</li>
<li>Mojo</li>
</ul>

<p>
You'll notice I left out Ada.  That's because Ada was designed
explicitly to <b>not</b> be C. Ada treats the compiler as a strict guardian
to prevent runtime catastrophes, rather than, for example, allowing
the programmer to cast pointers arbitrarily.  And those compile-time
safety checks are written in pure Ada.  But once it decides your code
is safe, it compiles to machine code with the GCC, which is written in
C.  So there's your cousin.
</p>
</div>
</div>
<div id="outline-container-orgceb3f0c" class="outline-3">
<h3 id="orgceb3f0c">One other reason</h3>
<div class="outline-text-3" id="text-orgceb3f0c">
<p>
The other reason I code in C is that I've been using that language
since 1974.  My first access to unix was at a community college near
Huntsville, AL, the year I turned 15.  I've done a lot of these other
languages for money, but I don't write my own stuff in anything but C.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sat Jun 13 01:11:19 PM CDT 2026</p>
<p class="author">Author: bill wear</p>
<p class="date">Created: 2026-06-13 Sat 14:22</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
